---
kind: method
id: M:Autodesk.Revit.DB.ElementArray.Clear
source: html/5a1440e5-ac5f-a412-9e6f-72735fbdc22c.htm
---
# Autodesk.Revit.DB.ElementArray.Clear Method

Removes every element from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```